# Essential dev tools
brew 'curl', greedy: true
brew 'fzf', greedy: true
brew 'git', greedy: true
brew 'jq', greedy: true
brew 'neovim', greedy: true
brew 'tig', greedy: true
brew 'tldr', greedy: true
brew 'tmux', greedy: true
cask 'diffmerge', greedy: true
cask 'kitty', greedy: true

# Better terminal tools
brew 'bat', greedy: true
brew 'bpytop', greedy: true
brew 'fd', greedy: true
brew 'exa', greedy: true
brew 'git-delta', greedy: true
brew 'htop', greedy: true
brew 'ncdu', greedy: true
brew 'prettyping', greedy: true
brew 'ripgrep', greedy: true
brew 'rpl', greedy: true

# Generally useful apps
cask 'alfred', greedy: true
cask '1password', greedy: true
cask 'rectangle', greedy: true
cask 'obsidian', greedy: true
cask 'spotify', greedy: true

# Browser corner
cask 'firefox', greedy: true
cask 'google-chrome', greedy: true

# Better fonts for dev
tap "homebrew/cask-fonts"
cask 'font-hasklig', greedy: true
