# Essential dev tools
brew 'curl'
brew 'diff-so-fancy'
brew 'fzf'
brew 'git'
brew 'jq'
brew 'neovim'
brew 'tig'
brew 'tldr'
brew 'tmux'
brew 'watch'
cask 'kitty'

# Better terminal tools
brew 'bat'
brew 'bpytop'
brew 'fd'
brew 'exa'
brew 'git-delta'
brew 'htop'
brew 'ncdu'
brew 'prettyping'
brew 'ripgrep'
brew 'rpl'
brew 'gum'

# Generally useful apps
cask 'alfred'
cask '1password'
cask 'rectangle'
cask 'obsidian'
cask 'spotify'
cask 'flameshot'
cask 'keybase'
cask 'secretive'

# Browser corner
cask 'firefox'
cask 'google-chrome'

# Better fonts for dev
tap "homebrew/cask-fonts"
cask 'font-hasklig'
cask 'font-symbols-only-nerd-font'
